In [1]:
# Importing Libraries

import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

#Loading data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

#Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

c:\Users\USER\anaconda3\envs\data_env\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [2]:
df.iloc[0:10, 5]

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
8    False
9     True
Name: job_work_from_home, dtype: bool

In [3]:
df.loc[:, 'salary_rate': 'salary_hour_avg'].dropna(subset='salary_rate')

       salary_rate  salary_year_avg  salary_hour_avg
28            year         109500.0              NaN
43            hour              NaN             97.5
51            hour              NaN             72.5
77            year         140000.0              NaN
92            year         120000.0              NaN
...            ...              ...              ...
785624        year         139216.0              NaN
785641        year         150000.0              NaN
785648        year         221875.0              NaN
785682        year         157500.0              NaN
785692        year         157500.0              NaN

[33067 rows x 3 columns]

In [4]:
median_salary_year = df['salary_year_avg'].median()

In [5]:
median_salary_hour = df['salary_hour_avg'].median()

In [6]:
df_filled = df

df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg'] = df_filled['salary_year_avg'].fillna(median_salary_hour)

In [7]:
df_filled.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0         115000.0
1          115000.0         115000.0
2          115000.0         115000.0
3          115000.0         115000.0
4          115000.0         115000.0
5          115000.0         115000.0
6          115000.0         115000.0
7          115000.0         115000.0
8          115000.0         115000.0
9          115000.0         115000.0
10         115000.0         115000.0

In [10]:
df_unique = df_filled

df_unique = df_unique.drop_duplicates()

df_unique = df_filled.drop_duplicates()

print('Length of original df:        ', len(df_filled))
print('Length after dropping duplicates:', len(df_unique))

rows_dropped = len(df_filled) - len(df_unique)
print('Rows Dropped:                 ', rows_dropped)

Length of original df:         785741
Length after dropping duplicates: 785640
Rows Dropped:                  101